
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 3 to change, 1 to destroy.</code></pre>

* Create
  * azapi_resource.add_local_user
  * azurerm_storage_account.sftp_storage
  * azurerm_storage_container.sftp_container
  * module.sscs-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.sscs-sya-submit-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
* Update
  * module.sscs-fail-action-group.azurerm_resource_group_template_deployment.action-group
  * module.sscs-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group
  * module.sscs-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * module.sftp_storage.random_string.storage_account_random_string


<details><summary>Change Result (Click me)</summary>

```hcl

  # azapi_resource.add_local_user will be created
  + resource "azapi_resource" "add_local_user" {
      + body                      = (sensitive)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = (sensitive)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Storage/storageAccounts/localUsers@2021-09-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_storage_account.sftp_storage will be created
  + resource "azurerm_storage_account" "sftp_storage" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = true
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "sscssftpaat"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "sscs-aat"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = true
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          + "Team Contact"        = "#sscs"
          + "Team Name"           = "SSCS Team"
          + "application"         = "social-service-child-support"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#sscs-tech"
          + "environment"         = "staging"
          + "managedBy"           = "SSCS"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # azurerm_storage_container.sftp_container will be created
  + resource "azurerm_storage_container" "sftp_container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "upload"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "sscssftpaat"
    }

  # module.sftp_storage.random_string.storage_account_random_string will be destroyed
  # (because random_string.storage_account_random_string is not in configuration)
  - resource "random_string" "storage_account_random_string" {
      - id          = "vyvzat4nugdi21hkttuhqu76" -> null
      - length      = 24 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "vyvzat4nugdi21hkttuhqu76" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.sscs-fail-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/SSCSF_alert"
        name                     = "SSCSF_alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged elements hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.sscs-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/SSCSF_slack"
        name                = "SSCSF_slack"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged elements hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.sscs-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be created
  + resource "azurerm_resource_group_template_deployment" "custom_alert" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "sscs-fail-alert"
      + output_content      = (known after apply)
      + parameters_content  = jsonencode(
            {
              + actionGroupName          = {
                  + value = "SSCS Fail Alert - aat"
                }
              + actionGroupRg            = {
                  + value = "sscs-aat"
                }
              + alertDesc                = {
                  + value = "Triggers when an SSCS exception is received in a 5 minute poll."
                }
              + alertName                = {
                  + value = "sscs-fail-alert"
                }
              + appInsightsName          = {
                  + value = "sscs-aat"
                }
              + appInsightsQuery         = {
                  + value = "exceptions | where appName == \"sscs-prod\" | sort by timestamp desc"
                }
              + commonTags               = {
                  + value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvc3Njcy1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYXBwbGljYXRpb24iOiJzb2NpYWwtc2VydmljZS1jaGlsZC1zdXBwb3J0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY2hhbmdlVXJsIjoiIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNzc2NzLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJTU0NTIn0="
                }
              + customEmailSubject       = {
                  + value = "SSCS Service Exception"
                }
              + frequencyInMinutes       = {
                  + value = 5
                }
              + location                 = {
                  + value = "uksouth"
                }
              + severityLevel            = {
                  + value = "3"
                }
              + timeWindowInMinutes      = {
                  + value = 5
                }
              + triggerThreshold         = {
                  + value = 0
                }
              + triggerThresholdOperator = {
                  + value = "GreaterThan"
                }
            }
        )
      + resource_group_name = "sscs-aat"
      + template_content    = jsonencode(
            {
              + $schema        = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName          = {
                      + type = "string"
                    }
                  + actionGroupRg            = {
                      + type = "string"
                    }
                  + alertDesc                = {
                      + type = "string"
                    }
                  + alertName                = {
                      + type = "string"
                    }
                  + appInsightsName          = {
                      + type = "string"
                    }
                  + appInsightsQuery         = {
                      + type = "string"
                    }
                  + commonTags               = {
                      + type = "string"
                    }
                  + customEmailSubject       = {
                      + type = "string"
                    }
                  + frequencyInMinutes       = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + location                 = {
                      + type = "string"
                    }
                  + severityLevel            = {
                      + defaultValue = "3"
                      + type         = "string"
                    }
                  + timeWindowInMinutes      = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + triggerThreshold         = {
                      + type = "string"
                    }
                  + triggerThresholdOperator = {
                      + allowedValues = [
                          + "GreaterThan",
                          + "Equal",
                          + "LessThan",
                        ]
                      + defaultValue  = "GreaterThan"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-09-01-preview"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('alertName')]"
                      + properties = {
                          + action      = {
                              + aznsAction = {
                                  + actionGroup  = [
                                      + "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  + emailSubject = "[parameters('customEmailSubject')]"
                                }
                              + odata.type = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              + severity   = "[parameters('severityLevel')]"
                              + status     = "Active"
                              + trigger    = {
                                  + consecutiveBreach = 1
                                  + threshold         = "[parameters('triggerThreshold')]"
                                  + thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          + description = "[parameters('alertDesc')]"
                          + enabled     = "true"
                          + schedule    = {
                              + frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              + timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          + skuType     = "L1"
                          + source      = {
                              + dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              + query        = "[parameters('appInsightsQuery')]"
                              + queryType    = "ResultCount"
                            }
                        }
                      + tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + [concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))] = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.sscs-sya-submit-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be created
  + resource "azurerm_resource_group_template_deployment" "custom_alert" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "sscs-sya-submit-fail"
      + output_content      = (known after apply)
      + parameters_content  = jsonencode(
            {
              + actionGroupName          = {
                  + value = "SSCS Fail Slack Alert - aat"
                }
              + actionGroupRg            = {
                  + value = "sscs-aat"
                }
              + alertDesc                = {
                  + value = "Triggers when SYA has multiple Appeal submission fails."
                }
              + alertName                = {
                  + value = "sscs-sya-submit-fail"
                }
              + appInsightsName          = {
                  + value = "sscs-aat"
                }
              + appInsightsQuery         = {
                  + value = "customEvents | where name contains \"SYA-SendToApi-Failed\" | where appName == \"sscs-prod\" | sort by timestamp desc"
                }
              + commonTags               = {
                  + value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvc3Njcy1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYXBwbGljYXRpb24iOiJzb2NpYWwtc2VydmljZS1jaGlsZC1zdXBwb3J0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY2hhbmdlVXJsIjoiIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNzc2NzLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJTU0NTIn0="
                }
              + customEmailSubject       = {
                  + value = "Multiple SSCS SYA Submission Failing"
                }
              + frequencyInMinutes       = {
                  + value = 15
                }
              + location                 = {
                  + value = "uksouth"
                }
              + severityLevel            = {
                  + value = "2"
                }
              + timeWindowInMinutes      = {
                  + value = 15
                }
              + triggerThreshold         = {
                  + value = 1
                }
              + triggerThresholdOperator = {
                  + value = "GreaterThan"
                }
            }
        )
      + resource_group_name = "sscs-aat"
      + template_content    = jsonencode(
            {
              + $schema        = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName          = {
                      + type = "string"
                    }
                  + actionGroupRg            = {
                      + type = "string"
                    }
                  + alertDesc                = {
                      + type = "string"
                    }
                  + alertName                = {
                      + type = "string"
                    }
                  + appInsightsName          = {
                      + type = "string"
                    }
                  + appInsightsQuery         = {
                      + type = "string"
                    }
                  + commonTags               = {
                      + type = "string"
                    }
                  + customEmailSubject       = {
                      + type = "string"
                    }
                  + frequencyInMinutes       = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + location                 = {
                      + type = "string"
                    }
                  + severityLevel            = {
                      + defaultValue = "3"
                      + type         = "string"
                    }
                  + timeWindowInMinutes      = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + triggerThreshold         = {
                      + type = "string"
                    }
                  + triggerThresholdOperator = {
                      + allowedValues = [
                          + "GreaterThan",
                          + "Equal",
                          + "LessThan",
                        ]
                      + defaultValue  = "GreaterThan"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-09-01-preview"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('alertName')]"
                      + properties = {
                          + action      = {
                              + aznsAction = {
                                  + actionGroup  = [
                                      + "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  + emailSubject = "[parameters('customEmailSubject')]"
                                }
                              + odata.type = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              + severity   = "[parameters('severityLevel')]"
                              + status     = "Active"
                              + trigger    = {
                                  + consecutiveBreach = 1
                                  + threshold         = "[parameters('triggerThreshold')]"
                                  + thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          + description = "[parameters('alertDesc')]"
                          + enabled     = "true"
                          + schedule    = {
                              + frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              + timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          + skuType     = "L1"
                          + source      = {
                              + dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              + query        = "[parameters('appInsightsQuery')]"
                              + queryType    = "ResultCount"
                            }
                        }
                      + tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + [concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))] = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.sscs-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat|sscs-aat"
        name                       = "sscs-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

Plan: 5 to add, 3 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azapi_resource.add_local_user has been deleted
  - resource "azapi_resource" "add_local_user" {
      - body                      = (sensitive) -> null
      - id                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Storage/storageAccounts/sscssftpaat/localUsers/sscsaat" -> null
      - ignore_casing             = false -> null
      - ignore_missing_property   = true -> null
      - location                  = "" -> null
      - name                      = (sensitive) -> null
      - output                    = jsonencode({}) -> null
      - parent_id                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Storage/storageAccounts/sscssftpaat" -> null
      - removing_special_chars    = false -> null
      - schema_validation_enabled = true -> null
      - tags                      = {} -> null
      - type                      = "Microsoft.Storage/storageAccounts/localUsers@2021-09-01" -> null
    }

  # azurerm_storage_container.sftp_container has been deleted
  - resource "azurerm_storage_container" "sftp_container" {
      - container_access_type   = "private" -> null
      - has_immutability_policy = false -> null
      - has_legal_hold          = false -> null
      - id                      = "https://sscssftpaat.blob.core.windows.net/upload" -> null
      - metadata                = {} -> null
      - name                    = "upload" -> null
      - resource_manager_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Storage/storageAccounts/sscssftpaat/blobServices/default/containers/upload" -> null
      - storage_account_name    = "sscssftpaat" -> null
    }

  # module.sftp_storage.azurerm_role_assignment.storage-account-role-assignment["Storage Blob Data Contributor"] has been deleted
  - resource "azurerm_role_assignment" "storage-account-role-assignment" {
      - id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Storage/storageAccounts/sscssftpaat/providers/Microsoft.Authorization/roleAssignments/f9bc43e0-48b1-1952-1e4c-c6e3b9dba582" -> null
      - name                 = "f9bc43e0-48b1-1952-1e4c-c6e3b9dba582" -> null
      - principal_id         = "aa694620-518d-44a4-b494-0f8fe298f2b0" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> null
      - role_definition_name = "Storage Blob Data Contributor" -> null
      - scope                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Storage/storageAccounts/sscssftpaat" -> null
    }

  # module.sftp_storage.azurerm_storage_account.storage_account has been deleted
  - resource "azurerm_storage_account" "storage_account" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "LRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = false -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Storage/storageAccounts/sscssftpaat" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = true -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "sscssftpaat" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value)
      - primary_blob_connection_string    = (sensitive value)
      - primary_blob_endpoint             = "https://sscssftpaat.blob.core.windows.net/" -> null
      - primary_blob_host                 = "sscssftpaat.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value)
      - primary_dfs_endpoint              = "https://sscssftpaat.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "sscssftpaat.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://sscssftpaat.file.core.windows.net/" -> null
      - primary_file_host                 = "sscssftpaat.file.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://sscssftpaat.queue.core.windows.net/" -> null
      - primary_queue_host                = "sscssftpaat.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://sscssftpaat.table.core.windows.net/" -> null
      - primary_table_host                = "sscssftpaat.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://sscssftpaat.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "sscssftpaat.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "sscs-aat" -> null
      - secondary_access_key              = (sensitive value)
      - secondary_connection_string       = (sensitive value)
      - sftp_enabled                      = true -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "BuiltFrom"              = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "Deployment Environment" = "aat"
          - "Destroy Me"             = "No"
          - "Team Contact"           = "#sscs"
          - "application"            = "social-service-child-support"
          - "businessArea"           = "CFT"
          - "changeUrl"              = ""
          - "contactSlackChannel"    = "#sscs-tech"
          - "environment"            = "staging"
          - "managedBy"              = "SSCS"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Deny" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {

          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }

          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }

          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {

          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.sscs-vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat|sscs-aat"
        name                       = "sscs-aat"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":147,"Program":"tfcmt","SHA1":"","Vars":{}} -->